//=============================================================================
// no_encount.js
// by デスポン
// 最終更新: 2016.3.17
//=============================================================================

/*:
 * @plugindesc ランダムエンカウントが発生しなくなります。
 * @author デスポン
 * @version 1.0
 * 
 * @help
 * ランダムエンカウントが発生しなくなるプラグインです。
 * シンボルエンカウントをメインにする場合などにマップにエンカウントを指定したいがそれを発生させたくない場合などに使えます。
 */
 
(function() {
    
    
    Game_Player.prototype.executeEncounter = function() {
      
    };

    
})();